# Brewfile
# Autor: Wendell Borges [perlporter@gmail.com]
# Data: 30/12/2020

# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "muesli/tap"

# packages
brew "ansible"
brew "antibody"
brew "asciinema"                # 
brew "bat"                      # cat alternative
brew "bpytop"                   # top alternative
brew "cmatrix"
brew "cloc"                     # count code lines
brew "cowsay"
brew "curl"                     # transfer a URL
brew "dos2unix"                 # convert file DOS to unix
brew "duf"                      # df alternative
brew "esptool"
brew "ffmpeg"                   # video converter
brew "fortune"                  # print a random quotes
brew "fzf"
brew "git"                      # newer version of Git
brew "gnupg"                    # 
brew "grep"                     # GNU grep - ggrep
brew "htop"                     # top alternative
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "keychain"
brew "kubectl"
brew "lazydocker"               #
brew "lazygit"                  #
brew "lolcat"
brew "lsd"                      # ls alternative
brew "mas"                      # install apps Mac App Store
brew "ncdu"
brew "neofetch"                 # command-line system information
brew "neovim"
brew "noti"                     # trigger a notification
brew "node"                     #
brew "nmap"
brew "python"                   #
brew "pyenv"                    #
brew "pyenv-virtualenv"         #
brew "platformio"
brew "shellcheck"               # Shell script analysis tool
brew "speedtest-cli"            # testing internet bandwidth
brew "telnet"                   # user interface TELNET protocol
brew "thefuck"                  #   
brew "tmux"                     # terminal multiplexer
brew "tree"                     # lists contents in a tree-like format
brew "vim"                      # Vi IMproved
brew "wget"                     # the nono-interactive network downloader
brew "youtube-dl"               # downlod videos from youtube or other platforms
brew "xz"                       # compress or decompress .xz files
brew "zsh"                      # newer version of ZSH
brew "zsh-syntax-highlighting"  #

# casks
cask "alfred"
cask "anydesk"
#cask "audacity"
cask "airbuddy"
cask "audio-hijack" 
cask "backblaze"          ## NOT INSTALL, /opt/homebrew/Caskroom/backblaze
cask "balenaetcher"
cask "bartender"
cask "betterzip"
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "geekbench"
cask "gemini"
cask "kindle"
brew "inkscape"
cask "istat-menus"
#cask "intel-power-gadget"       ## NEEDS PASSWORD
cask "iterm2"
#cask "keycastr"
cask "raspberry-pi-imager"
#cask "mactex-no-gui"            ## NEEDS PASSWORD
cask "minecraft"
cask "mpv"
cask "netspot"
cask "notion"
cask "raspberry-pi-imager"
cask "signal"
cask "switchresx"
#cask "texpad"
cask "transmission"
cask "utm"
cask "vagrant"			## NEEDS ROSSETA2 - sudo softwareupdate --install-rosetta
cask "viscosity"
cask "vmware-fusion"
cask "vnc-viewer"
cask "wireshark" 		## NEEDS PASSWORD
cask "xscreensaver"
cask "zoc"
cask "zoom"

# macOS App Store
mas "1Password 7", id: 1333542190
mas "Apple Configurator 2", id: 1037126344
mas "DaisyDisk", id: 411643860
mas "FruitJuice", id: 671736912
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Pixelmator", id: 407963104
#mas "The Unarchiver", id: 425424353
mas "Telegram", id: 747648890
mas "Shazam", id: 897118787
